# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitTypeSet..::..Contains Method
WireConduitTypeSet Class See Also
---
Tests for the existence of a conduit type within the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	WireConduitType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As WireConduitType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	WireConduitType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireConduitTypeThe conduit type to be searched for.
# ### Return Value
The Contains method returns True if the conduit type is within the set, otherwise False.
# See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace